'''
Задача 10
Найти количество цифр 5 в числе
    Пример:
        543231235643
        'В числе 2 5-ки.'
'''

# требуем число и только его!
s = ''
while not s.isdigit():
    s = input('Введите число: ')

n5 = 0
i = len(s)
while i > 0:
    i -= 1
    if '5' == s[i]:
        n5 += 1

# in russian, please
n5_100 = n5 % 100
n5_10 = n5_100 % 10
end = '5-ок'
if n5_100 >= 5 and n5_100 <= 20:
    pass
elif n5_10 == 1:
    end = '5-ка'
elif n5_10 >= 2 and n5_10 <= 4:
    end = '5-ки'

print('В числе', n5, end)