"""
Задача 3
Вывести сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
"""
summa = 0
i = 1
while i <= 100:
    summa += i
    i += 1
print('sum(1..100) =', summa)